Revit 2027 API
TriangulatedShellComponent Methods
The TriangulatedShellComponent type exposes the following members.
Methods
Name | Description
Clear |  Empties the contents of this TriangulatedShellComponent.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTriangle |  Returns the triangle corresponding to the given index.
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetVertex |  Returns the vertex with a given index.
GetVertices |  Returns the vertices of the triangulation.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace